{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "26"}, {"size": "8"}, {"size": "8"}]}}}, "outputs": {"output_1": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4097"}]}}, "output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/conv2d_12_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "242"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/batch_normalization_12_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/flatten_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_block_1/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "26"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "26"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1/conv2d_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "26"}, {"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1/batch_normalization_1_2/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1/conv2d_1_2/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_block_1_2/batch_normalization_2_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1_2/batch_normalization_2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1_2/conv2d_2_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "62"}, {"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1_2/batch_normalization_3_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1_2/conv2d_3_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_block_2_1/batch_normalization_4_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "98"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_2_1/batch_normalization_4_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "98"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_2_1/conv2d_4_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "98"}, {"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_2_1/batch_normalization_5_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_2_1/conv2d_5_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_2_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_block_3_1/batch_normalization_6_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "134"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_3_1/batch_normalization_6_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "134"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_3_1/conv2d_6_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "134"}, {"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_3_1/batch_normalization_7_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_3_1/conv2d_7_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_3_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_block_4_1/batch_normalization_8_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "170"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_4_1/batch_normalization_8_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "170"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_4_1/conv2d_8_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "170"}, {"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_4_1/batch_normalization_9_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_4_1/conv2d_9_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_4_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_block_5_1/batch_normalization_10_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "206"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_5_1/batch_normalization_10_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "206"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_5_1/conv2d_10_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "206"}, {"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_5_1/batch_normalization_11_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_5_1/conv2d_11_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_5_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv2d_13_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "242"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/batch_normalization_13_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/flatten_1_2/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "4097"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4097"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "26"}, {"size": "8"}, {"size": "8"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transpose", "op": "Transpose", "input": ["inputs", "StatefulPartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1/batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/transpose", "StatefulPartitionedCall/dense_block_1/batch_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1/batch_normalization_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_block_1/batch_normalization_1/batchnorm/mul_1", "StatefulPartitionedCall/dense_block_1/batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1/re_lu_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/dense_block_1/batch_normalization_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1/re_lu_1_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/dense_block_1/re_lu_1/Relu", "StatefulPartitionedCall/dense_block_1/conv2d_1/convolution/merged_input", "StatefulPartitionedCall/dense_block_1/batch_normalization_1_2/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/dense_block_1/conv2d_1_2/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/dense_block_1/re_lu_1_2/Relu", "StatefulPartitionedCall/dense_block_1/conv2d_1_2/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/dense_block_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/transpose", "StatefulPartitionedCall/dense_block_1/conv2d_1_2/convolution", "StatefulPartitionedCall/dense_block_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1_2/batch_normalization_2_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/dense_block_1/concat", "StatefulPartitionedCall/dense_block_1_2/batch_normalization_2_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1_2/batch_normalization_2_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_block_1_2/batch_normalization_2_1/batchnorm/mul_1", "StatefulPartitionedCall/dense_block_1_2/batch_normalization_2_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1_2/re_lu_2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/dense_block_1_2/batch_normalization_2_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_1_2/re_lu_3_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/dense_block_1_2/re_lu_2_1/Relu", "StatefulPartitionedCall/dense_block_1_2/conv2d_2_1/convolution/merged_input", "StatefulPartitionedCall/dense_block_1_2/batch_normalization_3_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/dense_block_1_2/conv2d_3_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/dense_block_1_2/re_lu_3_1/Relu", "StatefulPartitionedCall/dense_block_1_2/conv2d_3_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/dense_block_1_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/dense_block_1/concat", "StatefulPartitionedCall/dense_block_1_2/conv2d_3_1/convolution", "StatefulPartitionedCall/dense_block_1_2/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_block_2_1/batch_normalization_4_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/dense_block_1_2/concat", "StatefulPartitionedCall/dense_block_2_1/batch_normalization_4_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_2_1/batch_normalization_4_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_block_2_1/batch_normalization_4_1/batchnorm/mul_1", "StatefulPartitionedCall/dense_block_2_1/batch_normalization_4_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_2_1/re_lu_4_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/dense_block_2_1/batch_normalization_4_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_2_1/re_lu_5_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/dense_block_2_1/re_lu_4_1/Relu", "StatefulPartitionedCall/dense_block_2_1/conv2d_4_1/convolution/merged_input", "StatefulPartitionedCall/dense_block_2_1/batch_normalization_5_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/dense_block_2_1/conv2d_5_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/dense_block_2_1/re_lu_5_1/Relu", "StatefulPartitionedCall/dense_block_2_1/conv2d_5_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/dense_block_2_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/dense_block_1_2/concat", "StatefulPartitionedCall/dense_block_2_1/conv2d_5_1/convolution", "StatefulPartitionedCall/dense_block_2_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_block_3_1/batch_normalization_6_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/dense_block_2_1/concat", "StatefulPartitionedCall/dense_block_3_1/batch_normalization_6_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_3_1/batch_normalization_6_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_block_3_1/batch_normalization_6_1/batchnorm/mul_1", "StatefulPartitionedCall/dense_block_3_1/batch_normalization_6_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_3_1/re_lu_6_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/dense_block_3_1/batch_normalization_6_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_3_1/re_lu_7_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/dense_block_3_1/re_lu_6_1/Relu", "StatefulPartitionedCall/dense_block_3_1/conv2d_6_1/convolution/merged_input", "StatefulPartitionedCall/dense_block_3_1/batch_normalization_7_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/dense_block_3_1/conv2d_7_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/dense_block_3_1/re_lu_7_1/Relu", "StatefulPartitionedCall/dense_block_3_1/conv2d_7_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/dense_block_3_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/dense_block_2_1/concat", "StatefulPartitionedCall/dense_block_3_1/conv2d_7_1/convolution", "StatefulPartitionedCall/dense_block_3_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_block_4_1/batch_normalization_8_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/dense_block_3_1/concat", "StatefulPartitionedCall/dense_block_4_1/batch_normalization_8_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_4_1/batch_normalization_8_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_block_4_1/batch_normalization_8_1/batchnorm/mul_1", "StatefulPartitionedCall/dense_block_4_1/batch_normalization_8_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_4_1/re_lu_8_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/dense_block_4_1/batch_normalization_8_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_4_1/re_lu_9_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/dense_block_4_1/re_lu_8_1/Relu", "StatefulPartitionedCall/dense_block_4_1/conv2d_8_1/convolution/merged_input", "StatefulPartitionedCall/dense_block_4_1/batch_normalization_9_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/dense_block_4_1/conv2d_9_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/dense_block_4_1/re_lu_9_1/Relu", "StatefulPartitionedCall/dense_block_4_1/conv2d_9_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/dense_block_4_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/dense_block_3_1/concat", "StatefulPartitionedCall/dense_block_4_1/conv2d_9_1/convolution", "StatefulPartitionedCall/dense_block_4_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_5_1/batch_normalization_10_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/dense_block_4_1/concat", "StatefulPartitionedCall/dense_block_5_1/batch_normalization_10_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_5_1/batch_normalization_10_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/dense_block_5_1/batch_normalization_10_1/batchnorm/mul_1", "StatefulPartitionedCall/dense_block_5_1/batch_normalization_10_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_5_1/re_lu_10_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/dense_block_5_1/batch_normalization_10_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_block_5_1/re_lu_11_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/dense_block_5_1/re_lu_10_1/Relu", "StatefulPartitionedCall/dense_block_5_1/conv2d_10_1/convolution/merged_input", "StatefulPartitionedCall/dense_block_5_1/batch_normalization_11_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/dense_block_5_1/conv2d_11_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/dense_block_5_1/re_lu_11_1/Relu", "StatefulPartitionedCall/dense_block_5_1/conv2d_11_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/dense_block_5_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/dense_block_4_1/concat", "StatefulPartitionedCall/dense_block_5_1/conv2d_11_1/convolution", "StatefulPartitionedCall/dense_block_5_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/re_lu_12_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/dense_block_5_1/concat", "StatefulPartitionedCall/conv2d_12_1/convolution/merged_input", "StatefulPartitionedCall/batch_normalization_12_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/re_lu_14_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/dense_block_5_1/concat", "StatefulPartitionedCall/conv2d_13_1/convolution/merged_input", "StatefulPartitionedCall/batch_normalization_13_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/re_lu_12_1/Relu", "StatefulPartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transpose_2", "op": "Transpose", "input": ["StatefulPartitionedCall/re_lu_14_1/Relu", "StatefulPartitionedCall/transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/transpose_1", "StatefulPartitionedCall/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/flatten_1_2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/transpose_2", "StatefulPartitionedCall/flatten_1_2/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/flatten_1/Reshape", "StatefulPartitionedCall/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_2_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/flatten_1_2/Reshape", "StatefulPartitionedCall/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/dense_2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/re_lu_13_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/dense_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_2_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/dense_2_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_1_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/re_lu_13_1/Relu", "StatefulPartitionedCall/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/dense_1_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/dense_2_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_1_2/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/dense_1_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/dense_1_2/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of9.bin", "group1-shard2of9.bin", "group1-shard3of9.bin", "group1-shard4of9.bin", "group1-shard5of9.bin", "group1-shard6of9.bin", "group1-shard7of9.bin", "group1-shard8of9.bin", "group1-shard9of9.bin"], "weights": [{"name": "StatefulPartitionedCall/conv2d_12_1/convolution/merged_input", "shape": [1, 1, 242, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/batch_normalization_12_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/transpose_1/perm", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/flatten_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/dense_1/Cast/ReadVariableOp", "shape": [2048, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_1_2/Cast/ReadVariableOp", "shape": [256, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_1_2/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/transpose/perm", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/dense_block_1/batch_normalization_1/batchnorm/mul", "shape": [26], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_1/batch_normalization_1/batchnorm/sub", "shape": [26], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_1/conv2d_1/convolution/merged_input", "shape": [1, 1, 26, 144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_1/batch_normalization_1_2/batchnorm/sub", "shape": [144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_1/conv2d_1_2/convolution/ReadVariableOp", "shape": [3, 3, 144, 36], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/dense_block_1_2/batch_normalization_2_1/batchnorm/mul", "shape": [62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_1_2/batch_normalization_2_1/batchnorm/sub", "shape": [62], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_1_2/conv2d_2_1/convolution/merged_input", "shape": [1, 1, 62, 144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_1_2/batch_normalization_3_1/batchnorm/sub", "shape": [144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_1_2/conv2d_3_1/convolution/ReadVariableOp", "shape": [3, 3, 144, 36], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_1_2/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/dense_block_2_1/batch_normalization_4_1/batchnorm/mul", "shape": [98], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_2_1/batch_normalization_4_1/batchnorm/sub", "shape": [98], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_2_1/conv2d_4_1/convolution/merged_input", "shape": [1, 1, 98, 144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_2_1/batch_normalization_5_1/batchnorm/sub", "shape": [144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_2_1/conv2d_5_1/convolution/ReadVariableOp", "shape": [3, 3, 144, 36], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_2_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/dense_block_3_1/batch_normalization_6_1/batchnorm/mul", "shape": [134], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_3_1/batch_normalization_6_1/batchnorm/sub", "shape": [134], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_3_1/conv2d_6_1/convolution/merged_input", "shape": [1, 1, 134, 144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_3_1/batch_normalization_7_1/batchnorm/sub", "shape": [144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_3_1/conv2d_7_1/convolution/ReadVariableOp", "shape": [3, 3, 144, 36], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_3_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/dense_block_4_1/batch_normalization_8_1/batchnorm/mul", "shape": [170], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_4_1/batch_normalization_8_1/batchnorm/sub", "shape": [170], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_4_1/conv2d_8_1/convolution/merged_input", "shape": [1, 1, 170, 144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_4_1/batch_normalization_9_1/batchnorm/sub", "shape": [144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_4_1/conv2d_9_1/convolution/ReadVariableOp", "shape": [3, 3, 144, 36], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_4_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/dense_block_5_1/batch_normalization_10_1/batchnorm/mul", "shape": [206], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_5_1/batch_normalization_10_1/batchnorm/sub", "shape": [206], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_5_1/conv2d_10_1/convolution/merged_input", "shape": [1, 1, 206, 144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_5_1/batch_normalization_11_1/batchnorm/sub", "shape": [144], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_5_1/conv2d_11_1/convolution/ReadVariableOp", "shape": [3, 3, 144, 36], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_block_5_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv2d_13_1/convolution/merged_input", "shape": [1, 1, 242, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/batch_normalization_13_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/transpose_2/perm", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/flatten_1_2/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/dense_2_1/Cast/ReadVariableOp", "shape": [2048, 4097], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_2_1/BiasAdd/ReadVariableOp", "shape": [4097], "dtype": "float32"}]}]}